[
	/*
		{ condition: "reinforceSpecialty eq true" },
				{ condition: "demonstrateConfidence eq true" },
				{ condition: "establishSpecialtyInfo eq true" },
				{ condition: "establishLecture eq true" },
				{ condition: "callOnStudent eq true"},
				{ condition: "respondToQuestion eq true" },
				{ condition: "classOver eq true" }
	*/

	{
		"id": "Start",
		"content": "It's your first class, and it's been going well so far, like you knew it would. If you can make it through to the end without any major stumbles, you'll really impress Dr. Tennerson, who's here to evaluate you.",
		"conditions": ["establishLecture neq true"],
		"effects": [
			"set establishLecture true", 
			"set setting lecture",
			"set calledFranklin false",
			"set calledElika false",
			"set calledShy false",
			"set difficulty 1"
		]
	},
	{
		"id": "slide1",
		"content": "\"So you can see that as CO2 levels rise, the ocean becomes more acidic. Already 25% more acidic than in the 1800s.\"",
		//"conditions": [],
		"effects": ["set giveLecture true", "set lectureContent 1"]
	},
	{
		"id": "slide2",
		"content": "\"And we know that more acidic seawater makes it harder for shell-forming sea creatures like corals, oysters, and of course my own favorite life form, {ifState|specialty|shrimp|the shrimp|}{ifState|specialty|lobster|the lobster|}{ifState|specialty|coral|the coral|}.\"",
		"conditions": ["lectureContent eq 1"],
		"effects": ["set giveLecture true", "set lectureContent 2"]
	},
	{
		"id": "slide3",
		"content": "\"Even plankton, which is the base of the food chain for most ocean life, is affected. So there's a direct link between a rise in CO2 and the survival of most life in the oceans.\"",
		"conditions": ["lectureContent eq 2"],
		"effects": ["set giveLecture true", "set lectureContent 3"]
	},
	{
		"id": "questions",
		"content": "{ifState|questionsLeft|0|You're out of time for questions.|}{ifState|questionsLeft|1|You have time for one more question.|}{ifState|questionsLeft|2|You have time for a few more questions.|}{ifState|questionsLeft|3|You have time for a few questions.|}",
		"choices": 	[
			{ "gotoId" : "Elika1" },
			{ "gotoId" : "Franklin1" },
			{ "gotoId" : "Shy1" }
		],
		"repeatable": "true",
		"conditions": ["lectureContent eq 3"],
		"effects": []
	},

	{
		"id": "questionBridge",
		"choiceLabel": "Take another question.",
		"content": "You look around the room, weighing the raised hands against the remaining class time.",
		"conditions": [],
		"effects": []
	},

	//-------------ELIKA-----------------------------------------------------
	
	{
		"id": "Elika1",
		"choiceLabel": "Call on Élika: she's smart and passionate.",
		"content": "\"Doctor Banks, if the pH is changing, why aren't species adapting to those changes?\"<br><br>A smart question, and you know the answer-- letting you calm down a little.",
		"choices": [
			{ "gotoId" : "Elika2"}
		],
		"conditions": ["questionsLeft gt 0"],
		"effects": [
			"decr questionsLeft 1", 
			"decr difficulty 1", 
			"set callOnStudent true"
		]
	},
	{
		"id": "Elika2",
		"choiceLabel": "Answer Élika",
		"content": "\"Good question, Élika. The reason is that the current change is happening far faster than historical changes-- too fast for natural selection to react.\"<br><br>\"Only catastrophes like meteor strikes have changed the environment so quickly before-- and those catastrophes usually triggered mass extinctions.",
		"choices": [
			{ "gotoId" : "Elika3" },
			{ "gotoId" : "questionBridge" }
		],
		"conditions": [],
		"effects": []
	},
	{
		"id": "Elika3",
		"choiceLabel": "Élika looks like she has a follow-up.",
		"content": "You go back and forth with Élika for the next few minutes, which is pleasant, but you see some of the other students growing resentful that she's dominating the converation.",
		"choices": [
			{ "gotoId" : "questionBridge"}
		],
		"conditions": ["questionsLeft gt 0"],
		"effects": ["decr questionsLeft 1", "decr difficulty 1"]
	},

	//-------------Franklin-----------------------------------------------------
	
	{
		"id": "Franklin1",
		"choiceLabel": "Call on Franklin, also smart but skeptical about climate change.",
		"content": "\"Emma, you always say in this class that correlation does not imply causality. So why are all you global warming nuts so sure things are different this time?\"",
		"choices": [
			{ "gotoId" : "Franklin2"}
		],
		"conditions": ["questionsLeft gt 0"],
		"effects": [
			"decr questionsLeft 1", 
			"set callOnStudent true"
		]
	},
	{
		"id": "Franklin2",
		"choiceLabel": "Answer Franklin",
		"content": "Great. You're terrible at confrontations like this-- it's one of your biggest fears about becoming a professor.",
		"choices": [
			{ "gotoId" : "FranklinLogic1" },
			{ "gotoId" : "FranklinValues" },
			{ "gotoId" : "FranklinDodge" },
		],
		"conditions": [],
		"effects": ["incr difficulty 1"]
	},
	{
		"id": "FranklinLogic1",
		"choiceLabel": "Appeal to logic.",
		"content": "\"That's a good point, Franklin, but it's not applicable in this case. There are dozens of independent studies using many different techniques, that all suggest a causal link between increased CO2 and increased ocean acidity.",
		"choices": [
			{ "gotoId" : "FranklinLogic" }
		],
		"conditions": [],
		"effects": ["incr difficulty 1"]
	},
	{
		"id": "FranklinLogic2",
		"choiceLabel": "Continue.",
		"content": "\"When we see a recurring pattern, validated by independent techniques, the scientific method tells us our model of a system is useful.\"<br><br>He doesn't seem especially happy, but seems to accept the point. Good: that makes you feel a little better.",
		"choices": [
			{ "gotoId" : "FranklinMore" },
			{ "gotoId" : "questionBridge" }
		],
		"conditions": [],
		"effects": ["decr difficulty 1"]
	},
	{
		"id": "FranklinMore",
		"choiceLabel": "Franklin looks like he wants to respond.",
		"content": "Franklin dominates the discussion for the next few minutes. You thought it was important to let him have his say, but it uses up a lot of class time that maybe could have been better spent on other things.",
		"choices": [
			{ "gotoId" : "questionBridge" }
		],
		"conditions": ["questionsLeft gt 0"],
		"effects": ["incr difficulty 1", "decr questionsLeft 1"]
	},
	{
		"id": "FranklinValues",
		"choiceLabel": "Appeal to values.",
		"content": "\"Don't you think we have an ethical obligation to investigate this and take action, even if things aren't entirely settled?\" you reply. \"If there was a 97% chance your child was ill, wouldn't you act to protect her rather than wait?\"<br><br>Franklin seems annoyed by this response, but there are some positive murmurs from the rest of the class.",
		"choices": [
			{ "gotoId" : "FranklinMore" },
			{ "gotoId" : "questionBridge" }
		],
		"conditions": []
	},
	{
		"id": "FranklinDodge",
		"choiceLabel": "Dodge the question.",
		"content": "\"Let's not make this political,\" you say quickly. \"We're just talking about these particular results, nothing else.\"<br><br>Well, you avoided getting into a complex issue, which helps your stress, but there's a lot of unhappy faces in the crowd. Maybe you shouldn't have dodged the bullet.",
		"choices": [
			{ "gotoId" : "FranklinMore" },
			{ "gotoId" : "questionBridge" }
		],
		"conditions": [],
		"effects": ["decr difficulty 1"]
	},


	//-------------SHY-----------------------------------------------------

	{
		"id": "Shy1",
		"choiceLabel": "Call on a shy student in the back whose name you don't know.",
		"content": "\"Doctor Banks, I get the connection between CO2 and pH, but how exactly does higher pH interfere with mollusks and stuff?\"<br><br>It's a straightforward question... should you give it a straightforward answer, or try to inject a little personality?",
		"choices": [
			{ "gotoId" : "ShyStraight" },
			{ "gotoId" : "ShyExample" },
			{ "gotoId" : "ShyPersonal" }
		],
		"conditions": ["questionsLeft gt 0"],
		"effects": [
			"decr questionsLeft 1", 
			"set callOnStudent true"
		]
	},
	{
		"id": "ShyStraight",
		"choiceLabel": "Explain with a straightforward answer.",
		"content": "You briefly explain that the calcium carbonate minerals these creatures use to make their shells have a harder time calcifying as acidity goes up: if it's high enough, the shells are eaten away faster than they can form.<br><br>The class seems satisfied, but not particularly engaged.",
	},
	{
		"id": "ShyExample",
		"choiceLabel": "Explain with a cool example.",
		"content": "You think this might be a great opportunity to use that new chemistry visualization package you've got on your laptop. It should let you show visually how calcium carbonate is affected by higher acidity.",
		"choices": [
			{ "gotoId" : "ShyExample2" }
		]
	},
	{
		"id": "ShyExample2",
		"choiceLabel": "More.",
		"content": "It works! Within a few minutes, you've set up an example that shows higher and higher levels of acidity slowing down and eventually reversing the slow build-up of calcium carbonate that so many ocean creatures use to make their shells. Good thing you were able to keep your cool and do the demo so well."
	},
	{
		"id": "ShyPersonal",
		"choiceLabel": "Drop your guard: tell a personal anecdote.",
		"content": "It's scary, but you drop your guard a bit and try to make a personal connection, telling a story about a disastrous first date with a marine biologist who was researching this very question.",
		"choices": [
			{ "gotoId" : "ShyPersonal2" }
		],
		"effects": ["incr difficulty 1"]
	},
	{
		"id": "ShyPersonal2",
		"choiceLabel": "More.",
		"content": "The story seems to go over well... you get a couple smiles and laughs, and at the end when you tie it into the question, the shy student (Justin! You remember now) seems more engaged."
	},
]