[
	{
		"title": 	"Start",
		"scene": 	["\"So the graph shows us, uh, that the pH levels in each of these periods, or epochs, is sharply correlated with, er, within 3% of, um, the rise and fall of these ankrymatic species.\"",
					"Blank stares. You're losing them. Come on, Emma. Don't botch your first lecture ever. @@set losecool to 1@@ @@set update to 1@@ @@set stress to 0@@"],
		"choices": 	[
						[">>Skip to the point", "N2"],
						["Drop your guard: tell a personal anecdote", "N2"],
						["See if there are any questions.", "N2"]						
					]
	},
	{
		"title": 	"N2",
		"scene": 	["\"... so we can see the fossil record is very clear on this. When ocean pH changes, there's always a massive species die-off. And creatures like shellfish that are adapted to the current oceanic pH are put at extreme risk.\"",
					"Some hands go up. Who should you call on?"],
		"choices": 	[
						[">>Élika, a smart and passionate student", "N3"],
						["Franklin, also smart but skeptical about climate change", "N3"],
						["A shy student in the back whose name you don't know", "N3"]

					]
	},
	{
		"title": 	"N3",
		"scene": 	["\"Doctor Banks, if the pH has changed so much over historical levels, why haven't species adapted to survive those changes?\"@@incr stress@@", "\"Good question, Élika. Although technically I won't be 'Doctor' Banks for another few weeks.\" That wins you a few smiles.", "\"The reason is that these changes often happen far faster than evolution and natural selection can react. A meteorite strike or huge eruption that changes the amount of sunlight or ocean particulates overnight... it takes species thousands of years to adapt through the blind process of natural selection. Sudden changes-- like the mass industrialization that's happened in the past century and half-- can be fatal.\""],
		"choices": 	[
						["Elika raises her hand with a follow-up.", "N4"],
						[">> Franklin still has his hand up, and looks impatient.", "N4"],
						["<span style='color:gray'>(The shy student puts their hand down.)</span>", "N4"]

					]
	},
	{
		"title": 	"N4",
		"scene": 	["\"Emma, you always say in this class that correlation does not imply causality. So why are all you global warming nuts so sure things are different this time?\"@@mult stress 9@@", "Great. You're terrible at confrontations like this-- it's one of your biggest fears about becoming a professor.@@set losecool to 15@@"],
		"choices": 	[
						[">> Appeal to logic.", "N5"],
						["Appeal to emotion.", "N5"],
						["Appeal to values.", "N5"],
						["Dodge the question.", "N5"]
					]
	},
	{
		"title": 	"N5",
		"scene": 	["\"You're right to be skeptical. But in this case, an overwhelming amount of evidence collected over decades and from all different kinds of experiments all points to the same conclusions. When we see a recurring pattern like that, validated by independent techniques, the scientific method tells us we can start to be confident that our model of a system is useful.\""],
		"choices": 	[
						["Franklin has a follow-up.", "N6"],
						["Êlika seems to want to respond to that.", "N6"],
						["Another student has a different question.", "N6"]
					]
	},
	{
		"title": 	"N6",
		"scene": 	["After a few more questions, class time is officially over. You remind the students about the reading due Friday, and dismiss the class.", "Dr. Tennerson steps forward with a smile from his seat in the back, where he's been observing. @@set losecool to 0@@ @@set update to 0@@ \"You handled that well, Emma. I wouldn't worry. I think you're going to make a wonderful professor.\"", "<span style='color:gray'>[Reward: \"Didn't Play Favorites\"]</span>"],
		"choices": 	[
						["Back to start", "Start"]
					]
	}
	
]