[
	/*
		These are the global chunks that can be brought into any level

		Backstory: Fragments that can be seated with each character. Two types: Emma backstory that she might bring up at any point (that serves as exposition for her character) or general backstory from others about what it's like to live in a world with climate change

		Knowledge: These are nuggets of knowledge that can be inserted into lectures, arguments, etc.

		Challenge: Chunks that might turn up from students, dinner conversation, or workers saying that climate change isn't real.

		Support: Positive chunks saying we can make a difference.
	*/

	//---------------------------BACKSTORY---------------------------------------
	{
		"id": "EmmaScienceFair",
		//"speaker" : "global",
		"content": "4th grade? Mrs. Anderson? Oh my god, that diorama. I remember it was <i>huge</i>...it took forever for you to set up. You spent <i>ages</i> on that. What was it about again?",
		"conditions": [],
		"effects": []
	},

	//---------------------------KNOWLEDGE---------------------------------------
	{
		"id": "shrimpDanger",
		//"speaker" : "global",
		"content": "In places like Maine, the ocean temperature is rising so fast it's all but eliminated the shrimp supply already.",
		"conditions": ["career eq shrimp"],
		"effects": ["incr droppedKnowledge 1"]
	},
	{
		"id": "coralDanger",
		//"speaker" : "global",
		"content": "There's already been widespread bleaching reported of the Great Barrier Reef, and a lot of the species living there are dying out.",
		"conditions": ["career eq coral"],
		"effects": ["incr droppedKnowledge 1"]
	},
	{
		"id": "lobsterDanger",
		//"speaker" : "global",
		"content": "There have been a bunch of new diseases that are decimating lobster populations up in Maine. Seems the warmer oceans agree with viruses, at least.",
		"conditions": ["career eq lobster"],
		"effects": ["incr droppedKnowledge 1"]
	},
	{
		"id": "futureDanger",
		//"speaker" : "global",
		"content": "Have you heard of clathrates? They're basically frozen methane...some people call it 'fire ice'. Anyway, methane is much worse a greenhouse gas than CO2. If the planet warms up enough that the clathrates start releasing it into the atmosphere, we could be looking at a runaway feedback loop.",
		"conditions": [],
		"effects": ["incr droppedKnowledge 1"]
	},
	{
		"id": "oceanAcidic",
		//"speaker" : "global",
		"content": "\"So{ifStateCondition|confidence lt 0|, uh,|} you can see that as CO2 levels {ifStateCondition|confidence lt 0|fall-- er, no, I mean |}rise, the ocean becomes more acidic. Already 25% more acidic than in the 1800s.\"",
		"conditions": [],
		"effects": ["incr droppedKnowledge 1", "set awesome true"]
	}

	//---------------------------CHALLENGE---------------------------------------

	//---------------------------SUPPORT-----------------------------------------
]