[{
		"id": "establishScene",
		"content": "Tap-tap-tap-tap. Your feet follow a steady rhythm as you head through the hallway to your first class. As you get near the room, you begin to feel a bit {ifStateCondition|composure gte 5|excited|uneasy}.",
		"effects": [
			
			"set establishScene true",
			"set lecture true",
			"set composure 5"

		]
		
	},

	{
		"id": "establishLecture",
		"content": "Walking through the double doors, you are greeted by the shifting of backpacks and the sounds of little conversations throughout the lecture hall. It is a decent sized room, not bad for your first lecture. ",
		"effects": [
			"set establishDetails true"
		],
		"conditions": [
			"lecture eq true",
			"establishScene eq true"
		],
		"choices": [{
			"gotoId": "lookAround"
		}]
		
	},

	{
		"id": "establishSeminar",
		"content": "Walking through the door, you are greeted by a group of young-looking students engaged in various conversations. There are still a few minutes left before class begins so you take a seat and familiarize yourself with your surroundings.",
		"effects": [
			"set establishDetails true"
		],
		"conditions": [
			"seminar eq true",
			"establishScene eq true"
		],
		"choices": [{
			"gotoId": "lookAround"
		}]
	},

	{
		"id": "lookAround",
		"choiceLabel": "Look around the room",
		"content": "As your eyes scan the room, several things catch your attention.",
		"repeatable": "true",
		
		"choices": [{
				"gotoId": "seatNumber"
			},
			{
				"gotoId": "frontDesk"
			},
			{
				"gotoId": "whiteBoard"
			},
			{
				"gotoId": "composureBridge"
			}
		]
	},

	{
		"id": "seatNumber",
		"choiceLabel": "Look at all the seats",
		"unavailableChoiceLabel": "Already counted the seats",
		"content": "Your eyes quickly jump across all the seats in the room. {ifStateCondition|lecture eq true|There are easily enough seats for 200 students.|The room itself is not large but it is packed full of students who look eager to learn.} Seeing the faces watching in anticipation {ifStateCondition|composure gte 5|excites you.|applies more pressure than you are ready for.}",
		"effects": [
			"incr roomObjects 1"
		],
		"choices": [{
			"gotoId": "lookAround"
		}]
	},

	

	{
		"id": "frontDesk",
		"choiceLabel": "Glance down at your workstation",
		"unavailableChoiceLabel": "Already examined your workstation",
		"content": "The table in front of you is organized with an abundance of supplies. {ifStateCondition|composure gte 5| You will put all of them to good use.| It's actually a little overwhelming.}",
		"effects": [
			"incr roomObjects 1"
		],
		"choices": [{
			"gotoId": "lookAround"
		}]
	},

	{
		"id": "whiteBoard",
		"choiceLabel": "Check out the whiteboard",
		"unavailableChoiceLabel": "Already checked out the whiteboard",
		"content": "At the front of the room {ifStateCondition|lecture eq true|are 3 large whiteboards arranged side-by-side. A lot of room to work with.|is a large whiteboard. Just enough space to work with.}",
		"effects": [
			"incr roomObjects 1"
		],
		"choices": [{
			"gotoId": "lookAround"
		}]
	},

	{
		"id": "composureBridge",
		"unavailableChoiceLabel": "Familiarize yourself with the space first",
		"choiceLabel": "Start the class",
		"content": "You glance at the clock. {ifStateCondition|composure gte 5|Alright,|Oh no,} only 5 minutes left until class starts. After a few deep breaths, you find yourself {ifStateCondition|composure gte 5|calm and ready to go.|still pretty nervous.}",
		"conditions": [
			"roomObjects gt 2"
		],
		"choices":[
			{"gotoId": "lowConfidenceComposure"},
			{"gotoId": "mediumConfidenceComposure"},
			{"gotoId": "highConfidenceComposure"}
		]
	},

	{
		"id": "lowConfidenceComposure",
		
		"choiceLabel": "Begin class",
		"unavailableChoiceLabel": " ",
		"content": "It is now time for class to begin but you find yourself at a lost for words. After a few seconds of silence, you manage to force out, \"Umm hi, I mean uhh, hello class.\" At this point, you are seriously considering running far away from here. \"We'll be learning about climate change. Haha sorry, this is my first lecture.\" The last sentence is accompanied by a few seconds of forced laughter.",
		"effects": [
			"set establishComposure true"
		],
		"conditions": [
			"composure lt 5"
			
		],
		"choices": [
			{"gotoId": "lectureContent"}
		]
	},


	{
		"id": "mediumConfidenceComposure",
		"choiceLabel": "Begin class",
		"unavailableChoiceLabel": " ",
		"content": "As class begins, the students settle down and focus their attention to you. After clearing your throat, you begin class by saying, \"Hello everyone, welcome to my class, in which we will be discussing the issue of climate change.",
		"effects": [
			"set establishComposure true"
		],
		"conditions": [
			"composure gte 5",
			"composure lt 10"
		],
		"choices": [
			{"gotoId": "lectureContent"}
		]
		
	},

	{
		"id": "highConfidenceComposure",
		"choiceLabel": "Begin class",
		"unavailableChoiceLabel": " ",
		"content": "You cannot wait to get the class started. As soon as the class period begins, you clear your voice and say, \"Good afternoon everyone and welcome to my class! We're going to have a great time this semester learning about the issue of climate change and what we can do to help better the environment.\"",
		"effects": [
			"set establishComposure true"
		],
		"conditions": [
			
			"composure gte 10"
		],
		"choices": [
			{"gotoId": "lectureContent"}
		]
	},

	{
		"id": "lectureContent",
		"choiceLabel": "Give introduction",
		"content": "\"First things first,{ifStateCondition|composure lt 5| uh,|} I am going to give you all a sense of what this quarter will be like.\" You introduce the basic structure of the class and provide the students with a grading rubric and a little background about yourself. \"The content of the class is not necessarily super hard. My goal is to educate you on the effects of climate change and what you can do to help.\"",
		"choices":[{
			"gotoId": "lectureContent2"
		}]
		

	},

	{
		"id": "lectureContent2",
		"choiceLabel": "Give an example of what to expect",
		"content": "\"Just as an example of what you can expect, let me just provide an interesting statistic, just to get your feet wet. The water in our oceans is roughly{ifStateCondition|composure lt 5|\", the students watch you quietly as you pause to consult your notes, \"|} 25% more acidic than it was in the 1800s. This is because human actions are raising the CO2 levels in the {ifStateCondition|composure lt 5|water, err I mean, in the|} atmosphere.\"",
		"choices":[{
			"gotoId": "lectureContent3"
		}]
		
	},

	{
		"id": "lectureContent3",
		"choiceLabel": "Just a few more examples",
		"content": "You present a few more snippets of information before continuing with, \"Those were just a few examples of data that we will be studying. Besides effects of climate change, we will also be learning about how all of ways that you guys can help out locally and on the global scale.",
		"choices": [
			{"gotoId": "lectureBridge"},
			{"gotoId": "seminarBridge"}
		],
		"effects": [
			"set lectureFinished true"
		]
	},

	{
		"id": "lectureBridge",
		"choiceLabel": "Take some questions",
		"content": "30 {ifStateCondition|composure lt 5|long|} minutes of general examples later, you tell that class, \"well, now that you know the general idea behind what you can expect from this quarter, {ifStateCondition|composure gte 5|I can answer any questions that you guys have.|I guess I can try to answer your questions.}\"",
		"effects": [
			"set bridgeFinished true"
		],
		"conditions": [
			"lectureFinished eq true",
			"lecture eq true"
		],
		"choices":[{
			"gotoId":"establishStudents"
		}]
	},

	{
		"id": "seminarBridge",
		"choiceLabel": "Take some questions",
		"content": "\"{ifStateCondition|composure gte 5|Well that's enough talking for me.|Oh umm, I think I might be talking a bit too much.} Because this is not a lecture, {ifStateCondition|composure gte 5|We should have a discussion about climate change.|umm, I guess we can try to have a discussion about climate change.} Does anyone want to start off with a question?\"",
		"effects": [
			"set bridgeFinished true"
		],
		"conditions": [
			"lectureFinished eq true",
			"seminar eq true"
		],
		"choices":[{
			"gotoId":"establishStudents"
		}]

	},

	   {
      "id" : "franklinIntro",
      "unavailableChoiceLabel" : "Already called on {name|skepticStudent}.",
      "choiceLabel" : "Call on the student who delicately raised his hand with a skeptical frown.",
      "content" : "{name|skepticStudent} has a frown on his face, reports that his mom is an influential business partner for an oil company who has scientists working on these issues and asks a question that suggests that global warming is just a conspiracy.",
      "choices" : [
        {"gotoId" : "logicResponse"},
        {"gotoId" : "valueResponse"},
        {"gotoId" : "sourResponse"}
        ],
      "effects" : [
        "set skepticalStudent true",
        "incr talkToStudent 1",
        "decr questionsLeft 1"
      ]
    },

    {
      "id" : "logicResponse",
      "choiceLabel" : "Turn to the facts",
      "content" : "\"Good question! While there are a number of people in the world who believe in the same thing that your mom does, the facts don't lie. We will go over the specifics in future classes but here are some statistics for you. The global temperature has increased by 1.7 degrees fahrenheit since 1880, and the minimum amount of arctic ice decreases about 13.3 percent each decade.\" <p>Franklin's hand is once again in the air.</p>",
      "effects" : [
        "incr optimism 1",
        "incr hope 1",
        "incr curiosity 1"
      ]
    },

    {
      "id" : "sourResponse",
      "choiceLabel" : "\"Really? A conspiracy?\"",
      "content" : "\"So let me get this straight, there are hundreds of thousands of scientist around the world who dedicate their lives to studying climate change, and your mom is claiming that they are all liars? 95% of those scientist could prove, using real data that they or their peers worked hard to collect, that the Earth's climate is changing. And you're telling me that global warming isn't real?\"<p>Franklin's hand is once again in the air.</p>",
      "effects" : [
        "decr skepticCuriosity 2"
      ]
    },

    {
      "id" : "valueResponse",
      "choiceLabel" : "Your mom is biased",
      "content" : "\"Big oil companies like the one your mom works with are one of the leading causes of climate change. If laws and regulations were passed to limit the amount of carbon that buildings are allowed to emit, then it would probably hurt oil companies. So of course your mom thinks it's a conspiracy. But the facts don't lie.\"<p>Franklin's hand is once again in the air.</p>",
      "effects" : [
        "incr optimism 1",
        "incr curiosity 1"
      ]
    },

    {
      "id" : "franklinFollowUp",
      "content" : "Franklin's hand is once again in the air.",
      "choices" : [
        {"gotoId" : "franklinQuestion2"},
        {"gotoId" : "questionBrige"}
      ],
      "conditions" : ["skepticalStudent eq true"]
    },

    {
    	"id": "franklinQuestion2",
    	"choiceLabel": "\"Yes Franklin?\"",
    	"content": "Franklin inquires about what the point of saving the planet is. Stressing the fact that we will all be long gone before we even notice any large change in temperature.",
    	"choices": [
    		{"gotoId": "followUpAnswer1"},
    		{"gotoId": "followUpAnswer2"}
    	]
    },

    {
    	"id": "followUpAnswer1",
    	"choiceLabel": "\"The changes are more impactful than you think\"",
    	"content": "\"Well, {ifStateCondition|composure lt 5|uhhh,|}the impact of climate change is much larger than you think. {ifStateCondition|composure lt 5|If I remember correctly... |}The sea level has been steadily rising for the past 200 years. It is projected to rise another 1 to 4 feet in the next century. That is enough to cause many low sea level areas to flood. We have also see an increase in frequency of very strong hurricanes, which I'm sure is something you would rather not happen.\"",
    	"effects": [
    		"decr optimism 1",
    		"decr hope 1"
    	],
    	"choices": [{
    		"gotoId": "establishStudents"
    	}]
    },

    {
    	"id": "followUpAnswer2",
    	"choiceLabel": "\"It is still our home\"",
    	"content": "\"We were fortunate enough to be born on this planet so it is our duty to take car of it. You don't burn down your house when you're moving out because you want it to be clean for the next family. We won't be the last generation living here and it is our job to make sure the planet survives for many more generations.\"",
    	"effects": [
    		"incr optimism 1",
    		"incr hope 1"
    	],
    	"choices": [{
    		"gotoId": "establishStudents"
    	}]
    },

    {
    	"id": "followUpAsnwer3",
    	"choiceLabel": "\"Well, you don't have to care\"",
    	"content": "\"Whether you care or not is up to you. You're right, we won't be around to see all of the artic ice melt and swallow up all of the land, or to feel the temperature increase to unbarable levels. But with just a little effort from each of us, we could prevent our decendants from having to experience the slow death of our wonderful planet.\"",
    	"effects": [
    		"decr optimism 1",
    		"decr curiosity 1"
    	],
    	"choices": [{
    		"gotoId": "establishStudents"
    	}]
    },

	{
		"id": "lectureEndWell",
		"content": "As the end of the class period draws near, the eyes of every student are fixed on your, waiting for your permission to leave. \"Well, that concludes the first lecture. Sorry if it didn't go as smoothly as you were expecting, but we are all going to learn throughout this quarter. I'll see you all next time!\" The sound of books closing and backpacks being zipped up erupts all around the room and one-by-one, the students leave, some even flashing you a smile on the way out.",
		"effects": [
			"incr composure 3",
			"set lectureEnd true"
		],
		"conditions": [
			"composure gte 10",
			"bridgeFinished eq true"
		]
	},

	{
		"id": "lectureEndOk",
		"content": "You hear a faint rustling of bags and papers. You realize that the class period has ended and students are becoming restless. \"Oh I'm sorry guys, I promise to get better at this as the quarter goes on. I'll see you all next time!\"",
		"effects": [
			"incr composure 1",
			"set lectureEnd true"
		],
		"conditions": [
			"composure gte 5",
			"composure lt 10",
			"bridgeFinished eq true"
		]
	},

	{
		"id": "lectureEndBadly",
		"content": "You spot a few students leaving early and your eyes dart to the clock, afraid that you have gone past the end of the class period, but there are still a lot of time left. You are thrown off by what just happened and lose your train of though. \"Umm haha sorry everyone, I completely forgot what I was going to talk about next. Uhh there wasn't that much left anyways so I guess you're dismissed for today. I'll see you next time.\"",
		"effects": [
			"incr composure -2",
			"set lectureEnd true"
		],
		"conditions": [
			"composure lt 5",
			"bridgeFinished eq true"
		]
	}



]