/*Sources:
http://news.nationalgeographic.com/2015/06/150623-sixth-extinction-kolbert-animals-conservation-science-world/
*/

[

  //elika presents

  {
    "id": "elikaPresentation",
    "content": "Élika hops up next to where her first slide was blossoming upon the screen, beaming at the three of you. \"Hello, everyone!\" she says, her arm sweeping up into the air. \"I'm super pleased to present to you my dissertation: a vigorous look into the ultimate extinction of the human race!\"",
    "choices" : [
      {"gotoId" : "ohMy"},
      {"gotoId" : "thisInteresting"},
      {"gotoId" : "thisUnexpected"}
    ],
    "effects": [
      "set studentGivesPresentation true"
    ],
    "conditions" : [
      "establishAudience eq true",
      "enthusiasticStudent eq true"
    ]
  },

  {
  "id": "ohMy",
  "choiceLabel": "...Oh my.",
  "request": {"gotoId": "elikaPresentsSlide1"},
  },

  {
    "id": "thisInteresting",
    "choiceLabel": "This sounds interesting.",
    "request": {"gotoId": "elikaPresentsSlide1"},
  },

  {
    "id": "thisUnexpected",
    "choiceLabel": "...Was not expecting that.",
    "request": {"gotoId": "elikaPresentsSlide1"},
  },

  {
    "id" : "elikaPresentsSlide1",
    "content" : "Élika is practically dancing on the tips of her toes. \"Specifically, I will be discussing the ridiculously high extinction rates of other species, how those correlate with human activity, and how such rates relate to how long human beings will be able to continue their existence on this planet!\" <br/><br/>... She looks <i>so</i> excited for this.",
    "choices" : [
      {"gotoId" : "elikaPresentsSlide2"},
    ],
    "conditions" : [
      "studentGivesPresentation eq true"
    ]
  },

  {
    "id" : "elikaPresentsSlide2",
    "choiceLabel" : "Continue",
    "content" : "\"Taking into account the species we are aware of, the current extinction rate has risen to over one hundred times higher since the last study thirty years ago - which is just one of the signs that we're about to experience the 'Sixth Great Extinction.'\" The next slide reveals a stock photo of a smiling businessman. \"And the culprit? Humans, naturally!",
    "choices" : [
      {"gotoId" : "elikaPresentsSlide3"}
    ]
  },

  {
    "id" : "elikaPresentsSlide3",
    "choiceLabel" : "Continue.",
    "content" : "\"Overhunting. Overfishing. Overlogging. Introducing invasive species. Releasing an overabundance of greenhouse gases in our atmosphere. Human activity has caused climate change so drastic that the global temperature has risen, the chemistry of the oceans have shifted, and the very face of our planet has been rearranged in accordance to our wants.\"",
    "choices" : [
      {"gotoId" : "elikaPresentsSlide4"}
    ]
  },

  {
    "id" : "elikaPresentsSlide4",
    "choiceLabel" : "Continue",
    "content" : "\"Thus, I have dug deep into the effects of human activity in order to answer the question of just how long humans can adapt and last to the consequences, before falling victim to our own handiwork, like so many species before us have already.\"",
    "choices" : [
      {"gotoId" : "howFascinating"},
      {"gotoId" : "howMorbid"},
      {"gotoId" : "howRelevant"},
    ],
  },

  {
    "id" : "howFascinating",
    "choiceLabel" : "How fascinating.",
    "request" : {
      "gotoId" : "elikaFinishes"
    },
  },

  {
    "id" : "howMorbid",
    "choiceLabel" : "How morbid.",
    "request" : {
      "gotoId" : "elikaFinishes"
    },
  },

  {
    "id" : "howRelevant",
    "choiceLabel" : "How relevant.",
    "request" : {
      "gotoId" : "elikaFinishes"
    },
  },

  {
    "id" : "elikaFinishes",
    "content" : "After about an hour of detailed analysis on extinction rates, accompanied by slides plastered with brightly colored images and plenty of smiley-faces, Élika concludes with a rather well-reasoned prediction of the end of humankind using her previously-presented evidence. You can see your fellow faculty member on your right nodding her head.",
    "conditions" : [
      "studentGivesPresentation eq true"
    ]
  },

  //audience asks elika

  {
    "id": "audienceAsksElika",
    "choiceLabel": "Continue",
    "content": "Élika dons a contented smile as she surveys her audience. \"Does anyone have any questions?\" she says, as if she hadn't just thoroughly explained an impending doomsday. <br/><br/>\"Uh, yeah,\" Franklin pipes up. \"How can you possibly be happy about that?!\"",
    "choices" : [
      {"gotoId" : "audienceAsksElika2"}
    ]
  },

  {
    "id" : "audienceAsksElika2",
    "choiceLabel" : "Continue",
    "content" : "Élika's eyebrows lift. \"Happy?\" <br/><br/>\"Look at you!\" Franklin sputters, gesturing wildly. <br/><br/>\"Y-you're saying all these horrible things with a smile on your face!\" <br/><br/>Said smile begins to falter. \"I - I, uh, I didn't mean -\"",
    "choices": [
      {
        "gotoId": "emmaHelpElika"
      },
      {
        "gotoId": "emmaNoHelpElika"
      }
    ],
    "effects" : [
      "set audienceAsksQuestion true"
    ],
    "conditions" : [
      "studentGivesPresentation eq true"
    ]
  },

  {
    "id": "emmaHelpElika",
    "choiceLabel": "Step in - Franklin's out of line here.",
    "content": "\"It's... difficult to explain...\" Elika says, voice strained, and you can't handle it anymore. As Elika's voice trails off, you take the opportunity to raise a hand and say, \"I don't believe that is a relevant question at the moment. Let's move on for the sake of time, shall we?\" <br/><br/> Franklin's cheeks puffed up in indignation, but Elika's shoulders slump forward in relief.",
  },

  {
    "id" : "emmaHelps2",
    "choiceLabel" : "You nod to Elika to continue.",
    "content" : "Elika's face quickly returns to its pleasant expression. \"I will say really quickly that everyone has coping methods in grappling with the knowledge that the world will end one day,\" she says with a shrug. \"That's all.\"",

  },

  {
    "id": "emmaNoHelpElika",
    "choiceLabel": "See how Élika handles this.",
    "content": "You lean back in your chair and watch Elika fumble with her words, curious as to how your former student will handle the accusation. \"It's... difficult to explain,\" Elika manages to say. \"You see it's... it's not that...\"",
  },

  {
    "id" : "emmaNotHelps2",
    "choiceLabel" : "You cross your arms and watch as she takes a moment to gather herself with a breath.",
    "content" : "\"It's not that I'm... glad, per se, it's more like I'm just dealing with the knowledge that this will end and our existence doesn't really matter in the grand scheme of things.\" Franklin's eyebrows furrow in concern, but Elika quickly says \"Thank you. Any other questions?\"",
    "choices" : [
      {"gotoId" : "emmaNotHelps3"}
    ]
  },

  {
    "id" : "emmaNotHelps3",
    "choiceLabel" : "Continue",
    "content" : "You smile, pleased to see her stand her ground. Her smile had returned to her face, but she still looks a little shaken.",
  },

//aiden presents

  {
    "id": "aidenPresentation",
    "content": "Aiden holds their hands comfortably clasped in front of them, standing next to the screen with their gaze held high. You can see Aiden's thumb rub their other hand nervously. \"Hello,\" they say, their voice soft. \"I'm here to talk about the forest owlet - or the heteroglaux blewitti, to call it by its scientific name.\"",
    "choices" : [
      {"gotoId" : "largeTalons"},
      {"gotoId" : "inIndia"},
      {"gotoId" : "theyExtinct"},
    ],
    "effects": [
      "set studentGivesPresentation true"
    ],
    "conditions" : [
      "establishAudience eq true",
      "shyStudent eq true"
    ]
  },

  {
    "id" : "largeTalons",
    "choiceLabel" : "Aw, I love those little guys and their enormous talons.",
    "request" : {"gotoId" : "aidenPresentsSlide2"},
  },

  {
    "id" : "inIndia",
    "choiceLabel" : "Ah yes, the one found in central India.",
    "request" : {"gotoId" : "aidenPresentsSlide2"},
  },

  {
    "id" : "theyExtinct",
    "choiceLabel" : "They're extinct, aren't they?",
    "request": {"gotoId": "aidenPresentsSlide2"},
  },

  {
    "id" : "aidenPresentsSlide2",
    "content" : "\"The forest owlet has been brought back from the very brink of extinction a couple of times, most notably in 1997, when they were rediscovered after 113 years of being recorded as extinct,\" Aiden says quietly. They close their eyes. \"Despite such efforts, they are now gone forever.\" For a moment, their voice wavers.",
    "choices" : [
      {"gotoId" : "heartPunch"},
      {"gotoId" : "heartRock"}
    ],
    "conditions" : [
      "studentGivesPresentation eq true"
    ]
  },

  {
    "id" : "heartPunch",
    "choiceLabel" : "You bring your hand to your heart.",
    "request": {"gotoId": "aidenPresentsSlide3"},
  },

  {
    "id" : "heartSolid",
    "choiceLabel" : "Your heart is made of stone, darn it!",
    "request": {"gotoId": "aidenPresentsSlide3"},
  },
  {
    "id" :  "aidenPresentsSlide3",
    "content" : "Aiden straightens their back. \"And so, I'll be presenting my thesis on how habit fragmentation, climate change, and science fraud has contributed to the undeserved end of a wonderful species,\" Aiden says. \"And how we can take care of more species in the future by focusing locally.\" Their eyes are blazing with passion.",
    "choices" : [
      {"gotoId" : "aidenFinishes"}
    ],
    "conditions" : [
      "studentGivesPresentation eq true"
    ]
  },

  {
    "id" : "aidenFinishes",
    "choiceLabel" : "Continue",
    "content" : "After the hour is up, you wonder if it's unprofessional to cheer after Aiden wraps up their presentation and asks politely for questions.",
    "choices" : [
      {"gotoId" : "audienceAsksAiden"}
    ]
  },

  {
    "id": "audienceAsksAiden",
    "choiceLabel" : "Continue",
    "content": "A lady wearing a hat adorned with feathers raises a hand, leaning forward. \"Ah, yes, hi, um,\" she says. \"Question. Don't we have more, um, important things to worry about than, ah - birds?\" <br/><br/> Aiden blinks at her. Their hands tighten around each other. \"S-sorry?\"",
    "choices" : [
      {"gotoId" : "audienceAsksAiden2"}
    ],
    "effects": [
      "set audienceAsksQuestion true"
    ],
    "conditions" : [
      "studentGivesPresentation eq true"
    ]
  },

  {
    "id" : "audienceAsksAiden2",
    "choiceLabel" : "Continue",
    "content" : "\"Well, it's like you mentioned, dear. Climate change is, um, quite bothersome,\" says the lady. \"Many folks are losing their homes. Going hungry. Buying only one car! - shouldn't we, um, worry about our <i>own</i> kind first? What have these owls done for us?\" She flips her hair. \"Besides, it's just one species.\"",
    "choices" : [
      {"gotoId" : "ohShit"},
      {"gotoId" : "wowPoint"},
      {"gotoId" : "sheDead"},
    ]
  },

  {
    "id" : "ohShit",
    "choiceLabel" : "Did she really just say that?",
    "request" : {"gotoId" : "audienceAsksAiden3"},
  },

  {
    "id" : "wowPoint",
    "choiceLabel" : "I mean. She has a point.",
    "request" : {"gotoId": "audienceAsksAiden3"},
  },

  {
    "id" : "sheDead",
    "choiceLabel" : "She is now dead to me."
  },

  {
    "id" : "audienceAsksAiden3",
    "content" : "If you look closely, you can tell that Aiden's trembling. \"You,\" they breathe. \"You dare - dare <i>sit</i> there and - and ask how birds are <i>useful</i> with a flipping <i>feather</i> in your hat!\" <br/><br/> The lady's cheeks are growing red fast. ",
    "choices": [
      {
        "gotoId": "emmaHelpAiden"
      },
      {
        "gotoId": "emmaNoHelpAiden"
      }
    ],
    "conditions" : [
      "studentGivesPresentation eq true"
    ]
  },

  {
    "id": "emmaHelpAiden",
    "choiceLabel": "I should probably step in.",
    "content": "\"Alright, everyone, let's stay professional,\" you say quickly. Aiden blinks, then their eyes widen. \"A - apologies,\" they mumble. \"It's - you see, even if the forest owlet may not seem useful to <i>us</i>, they were still essential to their own ecosystem.\" Their gaze darts down. \"Not everything has to be about humankind.\"",
  },

  {
    "id": "emmaNoHelpAiden",
    "choiceLabel": "Where's the popcorn?",
    "content": "Aiden inhales deeply. \"Look,\" they say. \"We're not the only beings on this planet. I think we can care about more living beings other than ourselves.\" <br/><br/>The lady's sputtering. \"I was just <i>saying</i> -\" <br/><br/>\"I know. Species extinction is just one problem - but it's still an important one. Every species keep the balance of the planet's ecosystems.\"",
  },

  {
    "id": "emmaAsksAiden",
    "content": "Now, time for the panel's questions. Aiden shifts from one foot to the other, looking like they were trying to keep their hand-wringing as small as possible. You look down at your notes, drumming up questions in your head.",
    "choices": [
      {
        "gotoId": "aidenSoftball"
      },
      {
        "gotoId": "aidenMiddle"
      },
      {
        "gotoId": "aidenHardcore"
      }
    ],
    "effects": [
      "set emmaAsksQuestion true"
    ]
  },

  {
    "id": "aidenSoftball",
    "choiceLabel": "Could you elaborate on how focusing on local work would benefit endangered species?",
    "content": "They seem to be focused locally, which has you secretly pleased. Let's see how much they can tell you about it. <br/><br/> Aiden perks up, looking almost excited. \"Well, even though there are laws on a federal level that can help, we can directly aid the recovery of endangered species locally.\"",
    "choices" : [
      {"gotoId" : "aSoftcore2"}
    ]
  },

  {
    "id" : "aSoftcore2",
    "choiceLabel" : "Continue",
    "content" : "\"We can work to protect habitats from threats like logging, contaminated water, and invasive species, and - and help restore them, too!\" There lies a determined look on their face, their hands in fists before them. <br/><br/> You smile. <i>I like your passion, kid,</i> you can't help but think fondly, even though your previous student is a kid no more.",
  },

  {
    "id": "aidenMiddle",
    "choiceLabel": "Why choose to focus on the forest owlet? Why is the loss of this species significant?",
    "content": "Aiden tilts their head. \"Um, well, I believe that the loss of any species makes a significant impact on the ecosystem they've left - owls in particular, they occupy a nocturnal niche, so they keep the nocturnal prey population under control. They keep the balance.\" They gesture a little more. \"Forest owlets are, um, endemic to India, so their presence is particularly important.\"",
  },

  {
    "id": "aidenHardcore",
    "choiceLabel": "Would it be too slow to focus on one species at a time?",
    "content": "\"Focusing on each would mean greater chance of recovery because of the work spent on them; perhaps focusing on groups?\""
  },

]
