[ {
    "id": "dummyFragment",
    "content": "select your character",
    "effects": [
      "set establishSetting true"
    ],
    "choices":[
      {"gotoId": "setSkeptical"},
      {"gotoId": "setEnthusiastic"},
      {"gotoId": "setShy"}
    ]
  },

  {
    "id": "setSkeptical",
    "content": "picked Franklin",
    "choiceLabel": "Skeptical Franklin",
    "effects": [
      "set skepticalStudent true"
    ]
  },

    {
    "id": "setEnthusiastic",
    "content": "picked Elika",
    "choiceLabel": "enthusiastic Elika",
    "effects": [
      "set enthusiasticStudent true"
    ]
  },

    {
    "id": "setShy",
    "content": "picked Aiden",
    "choiceLabel": "Shy Aiden",
    "effects": [
      "set shyStudent true"
    ]
  },

  {
    "id": "establishSettingSkeptical",
    "content": "You have been waiting for this day for a long time. It seems like it was just yesterday that Franklin stood up in your lecture and questioned the existence of climate change, and now you are about to watch his PhD defense about climate change as a member of the committee. ",
    "choices": [
      {
        "gotoId": "establishAudience"
      }
    ],
    "conditions": [
      "skepticalStudent eq true"
    ],
    "effects": [
      "set establishSetting true"
    ]
  },
  {
    "id": "establishSettingEnthusiastic",
    "content": "You have been waiting for this day for a long time. It seems like it was just yesterday that Elika was a student in your lecture. She was always so eager to learn, and now you are about to watch her PhD defense about climate change as a member of the committee. ",
    "choices": [
      {
        "gotoId": "establishAudience"
      }
    ],
    "conditions": [
      "enthusiasticStudent eq true"
    ],
    "effects": [
      "set establishSetting true"
    ]
  },
  {
    "id": "establishSettingShy",
    "content": "You have been waiting for this day for a long time. It seems like it was just yesterday that Aiden was a student in your lecture, a little shy, but always interested in learning. And now, you are about to watch their PhD defense about climate change as a member of the committee. ",
    "choices": [
      {
        "gotoId": "establishAudience"
      }
    ],
    "conditions": [
      "shyStudent eq true"
    ],
    "effects": [
      "set establishSetting true"
    ]
  },
  {
    "id": "establishAudience",
    "repeatable": true,
    "content": "As {ifStateCondition|skepticalStudent eq true|Franklin|}{ifStateCondition|enthusiasticStudent eq true|Elika|}{ifStateCondition|shyStudent eq true|Aiden|} is preparing their presentation at the front of the room, you look around to the other audience members in the room.",
    "choices": [
      {
        "gotoId": "panelMembers"
      },
      {
        "gotoId": "friendsOfPresenter"
      },
      {
        "gotoId": "otherAudience"
      }
    ],
    "conditions": [
      "establishSetting eq true"
    ]
  },
  {
    "id": "panelMembers",
    "choiceLabel": "Look at other panel members",
    "content": "Sitting on either side of you are the other two panelists for the defense. To your right is professor Stephen Zhang, a well-known environmentalist who teaches at the university. And to your left is Dr. Mavery Winpun, an animal scientist who has published many articles regarding the importance of saving endangered species of insects. ",
    "effects": [
      "set establishAudience true"
    ]
  },
  {
    "id": "friendsOfPresenter",
    "choiceLabel": "The presenter seems to have friends here ",
    "content": "It would seem that {ifStateCondition|skepticalStudent eq true|Franklin|}{ifStateCondition|enthusiasticStudent eq true|Elika|}{ifStateCondition|shyStudent eq true|Aiden|} has a fair number of supporters in the audience. From a couple of friends to former professors, all here to watch {ifStateCondition|skepticalStudent eq true|Franklin|}{ifStateCondition|enthusiasticStudent eq true|Elika|}{ifStateCondition|shyStudent eq true|Aiden|} present their defense."
  },
  {
    "id": "otherAudience",
    "choiceLabel": "Look around to other attendees",
    "content": "Looking around at the small audience in the room, you notice {ifStateCondition|skepticalStudent eq true|another one of your former students. Oh! It's Elika, a very enthusiastic student from your lecture many years ago.|}{ifStateCondition|enthusiasticStudent eq true|another one of your former students. Oh! It's Franklin, who you remember to be fairly skeptical about climate change.|}{ifStateCondition|shyStudent eq true|a few things that stand out. There were a few people in suits, a woman wearing a large sun hat with feathers in it, and professor Chance Nitton, on of the professors at the university.|}"
  },
  {
    "id": "establishClimateChangeEffects",
    "content": "{ifStateCondition|skepticalStudent eq true|FranklinClimateChangePlaceholder|}{ifStateCondition|enthusiasticStudent eq true|Wondering what Elika will present in her defense, you recall that she has always been fascinated with wildlife. There is no doubt that she will be addressing the rapidly increasing extinction rate of animals.|}{ifStateCondition|shyStudent eq true|As Aiden sets up their slides, you examine the large picture in the center of the first slide. It is a well-shot picture of Aiden posing with a forest owlet. The picture must have been taken many years ago, considering the fact that the owlet, along with many other wildlife species, have all fallen victim to the rapidly increasing extinction rate.|}",
    "conditions": [
      "establishAudience eq true"
    ],
    "effects": [
      "set establishClimateChangeEffects true"
    ]
  },
  {
    "id": "emmaAsksElika",
    "content": "Looking down at your notes, you begin forming a question in your head to ask Elika.",
    "choices": [
      {
        "gotoId": "elikaEasyQuestion"
      },
      {
        "gotoId": "elikaMediumQuestion"
      },
      {
        "gotoId": "elikaHardQuestion"
      }
    ],
    "conditions": [
      "enthusiasticStudent eq true",
      "studentGivesPresentation eq true"
    ],
    "effects": [
      "set emmaAsksQuestion true"
    ]
  },
  {
    "id": "elikaEasyQuestion",
    "choiceLabel": "Give her an easy question",
    "content": "You decide to help Elika by throwing her an easier question. <p>\"What can we do to slow down the extinction of all the different species of animals?\"</p>",
    "choices": [
      {
        "gotoId": "elikaEasyQuestion"
      }
    ]
  },
  {
    "id": "elikaAnswerEasy",
    "content": "Elika paused for a moment before responding with a well thought out answer. She suggested a simple solution which consisted of limiting gas emissions and lowering the greenhouse gases in our atmosphere. After that is regulated, nature will take care of the rest and the wildlife population will start to grow again. ",
    "choiceLabel": "Listen to Elika's answer"
  },
  {
    "id": "elikaMediumQuestion",
    "choiceLabel": "General question",
    "content": "You decide to go with a more general question. <p>\"So what exactly is this great 'extinction' and how long until it happens?\"</p>",
    "choices": [
      {
        "gotoId": "elikaAnswerMedium"
      }
    ]
  },
  {
    "id": "elikaAnswerMedium",
    "content": "Elika looks around the ceiling while trying to gather her thoughts. She responds with, \"well, the 6th great extinction, also known as the holocene extinction, is actually already here. It has been happening for decades now due to human activity and influence on the climate. It predicts that one half of Earth's higher life forms by the year 2100.\"",
    "choiceLabel": "Listen to Elika's response"
  },
  {
    "id": "elikaHardQuestion",
    "choiceLabel": "Challenge her a little",
    "content": "You decide to challenge Elika a little bit. <p>\"I agree that overfishing and overhunting are huge problems, but fishing and hunting are also necessary to provide humanity with the resources we need to survive. My question is: How do we decide how much fishing or hunting we can do before it is too much?\"</p>",
    "choices": [
      {
        "gotoId": "elikaAnswerHard"
      }
    ]
  },
  {
    "id": "elikaAnswerHard",
    "content": "With a smile on her face and no hesitation at all, Elika responds with, \"well obviously, it is different for each different species, but we can record the growth and decline of the population. So we can keep hunting and fishing a certain species, as long as the population of that species grows just as fast as it declines.\"",
    "choiceLabel": "Listen to Elika's response"
  },
  {
    "id": "outro",
    "content": "Before leaving, you pull {ifStateCondition|skepticalStudent eq true|Franklin|}{ifStateCondition|enthusiasticStudent eq true|Elika|}{ifStateCondition|shyStudent eq true|Aiden|} aside. <p>\"Overall, I am extremely proud to see how far you have come. I remember many years ago when you were the {ifStateCondition|skepticalStudent eq true|skeptical|}{ifStateCondition|enthusiasticStudent eq true|enthusiastic|}{ifStateCondition|shyStudent eq true|shy|} student in my class, and now, you have obtained your PhD. Keep working hard and continue making me proud.\"</p>",
    "conditions": [
      "facultyDeliberate eq true"
    ],
    "effects": [
      "set outro true"
    ]
  }
]