[
	//undergradDeanScene-talon.json
	{
		"id": "sceneStart_t",
		"content": ["You walk; heading up the final flight of stairs and rounding the final corner -- you're reluctant to walk any faster so you stands, lingering before the door, with a pit in your stomach keeping you from knocking. Soaking up the last bits of courage left in yourself, your knuckles wrap the wood.<br><br>A hollow thud.<br><br>Not a moment goes by before a low but distinct voice beckoned her. It was {name|authorityFigure}."],
		"choices": [
			{"gotoId": "emmaEnter_t"}
		],
		"effects": [
			"decr confidence 1",		//lowering Emma's confidence by one for the fear of what the meeting might hold
		],
	},

//setting the scene
	{
		"id": "emmaEnter_t",
		"choiceLabel": "\"it's open\"",
		"content": "Your stiff arm pushes past the door.<br>{name|authorityFigure} was sitting behind his desk -- face in a bundle of papers -- not looking up. To you, he did not feel like a friend at this moment, or even a colleague; he felt like a boss.<br><br>You lift your head to speak.<br><br>\"{name|authorityFigure},\"  you say, the word catch in your throat -- a guttural sound.",
		"choices": [
			{"gotoId": "speakCont_t"}
		],
		"effects": [
			"set sceneSet true",
		],
	},
	{
		"id": "speakCont_t",
		"choiceLabel": "\"You{ifStateCondition|confidence lt 5|, uh..|} wanted to speak with me?\"",
		"content": "{name|authorityFigure} suspended his attention on the papers and raised his eyes to meet your gaze.<br>\"{name|protagonist}...\" he said.<br><br>Perhaps it was in your nature to over analyze when you are nervous, or perhaps it was the neutral tone in which he said your name, but you are unable to tell if he was upset. In many ways you felt like she was at the principal's office, only this time you {ifStateCondition|confidence lt 5|knew|didn’t know} why you were there. The Dean continued,<br><br>\"...do you know why I wanted to speak with you?\"",
		"choices": [
			{"gotoId": "emmaRespondsYes_t"},
			{"gotoId": "emmaRespondsNo_t"}
		],
		"effects": [
			"set sceneSet true",
		],
	},

//This path might lead to Summer's path: tension 0
	{
		"id": "emmaRespondsYes_t",
		"choiceLabel": "\"I think I do.\"",
		"content": "{name|authorityFigure} nodded at your acknowledgment; it was solemn and kind.<br>\"What’s going on, {name|protagonist}. It feels like night-and-day from where we were just a month ago.\"<br>your hands found their way to the hem of your blouse. You picked at a loose thread.<br>\"It’s just{ifStateCondition|confidence lt 5|...\" You hesitate. There was a long moment of silence. \"Just...\"|...}",
		"effects": [
			"set troubleWithLecture true"
		],
	},

//setting tension to 4
	{
		"id": "emmaRespondsNo_t",
		"choiceLabel": "\"No, I don’t think so.\"",
		"content": "\"You don’t?\" {name|authorityFigure} took his glasses off and massaged the red indentations that had formed on the bridge of his nose. He spoke carefully, \"{name|protagonist}, it’s about your performance these past few lectures.\"<br><br>{name|protagonist} looked at the Dean{ifStateCondition|confidence lt 5| and a sour frown formed across her face|.}.",
		"effects": [
			"set tension 4"
		],
		"choices":[
			{"gotoId": "emmaAnnoyed_t"}
		],
	},

//upping the tension by 2
	{
		"id": "emmaAnnoyed_t",
		"choiceLabel": "\"And…? what about the performances of my lectures?\"",
		"content": "{name|protagonist} stood, her face tight -- hot -- looking at the Dean, anticipating what he might say next. {name|authorityFigure} placed his glasses softly on the table and directed his full attention toward {name|protagonist}.<br>\"I don’t know what’s gotten into you lately? Your {lectures/seminars} have been in a slow decline since day one.\" The Dean shook his head and looked hard. \"{name|protagonist}, are you alright? Is everything okay at home?\"",
		"effects": [
			"set tension 6",
			"set troubleWithLecture true"
		],
		"choices": [
			{"gotoId": "emmaAngerRise_t"},
			{"gotoId": "emmaAngerSoften_t"}
		]
	},
//tension 10 path to Ian
	{
		"id": "emmaAngerRise_t",
		"choiceLabel": "\"Don’t patronize me, {name|authorityFigure}!\"",
		"content": "\"You have no right to speak to me that way!\"",
		"effects": [
			"set tension 10",
			"set troubleWithLecture true"
		]
	},
//tension lowers
	{
		"id": "emmaAngerSoften_t",
		"choiceLabel": "\"I... I'm not sure what to say.\"",
		"content": "\"Things don't feel like they did before. They're just... different. Somehow.\"",
		"effects": [
			"set troubleWithLecture true"
		]
	}
]